export default function Simulation() {
  return (
    <div dir="rtl" className="pages">
      <section className="schedule">
        <h2>لیگ خودرو های خودران</h2>
        <hr className="hr" />
        <p>
          لیگ خودروهای خودران فیرا با هدف خودران سازی حرکت خودروهای الکتریکی
          کنترل از راه دور دارای مکانیزم فرمان آکرمن با ابعاد حداکثر یک به ده
          ابعاد خودروهای شهری واقعی ایجاد شده است. این خودروها که نزدیکترین
          ساختار را به خودروهای شهری دارند، با استفاده از حسگرهایی که بر روی خود
          دارند می توانند خط کشی جاده، علائم راهنمایی و رانندگی و موانع را تشخیص
          داده و به صورت خودکار در محیط رانندگی کنند.
        </p>
      </section>
      <section className="schedule">
        <h2>مکانیزم فرمان آکرمن</h2>
        <hr className="hr" />
        <p>
          مکانیزم فرمان آکرمن در لیگ خودروهای خودران فیرا به منظور ارتباط بین
          کنترلرهای مختلف و خودروهای خودران در نظر گرفته شده است. این مکانیزم
          امکان ارسال دستورات از طریق اینترنت به کنترلرهای مختلف و دریافت
          اطلاعات از طریق اینترنت از کنترلرها را فراهم می کند. این مکانیزم از
          طریق پروتکل MQTT به کنترلرها ارسال دستورات می کند و از طریق پروتکل
          MQTT از کنترلرها اطلاعات دریافت می کند.
        </p>
      </section>
      <section className="schedule">
        <h2>قوانین</h2>
        <hr className="hr" />
        <p>
          لیگ خودروهای خودران فیرا با هدف خودران سازی حرکت خودروهای الکتریکی
          کنترل از راه دور دارای مکانیزم فرمان آکرمن با ابعاد حداکثر یک به ده
          ابعاد خودروهای شهری واقعی ایجاد شده است. این خودروها که نزدیکترین
          ساختار را به خودروهای شهری دارند، با استفاده از حسگرهایی که بر روی خود
          دارند می توانند خط کشی جاده، علائم راهنمایی و رانندگی و موانع را تشخیص
          داده و به صورت خودکار در محیط رانندگی کنند.
        </p>
      </section>
    </div>
  );
}
